УТ114.CRM_Monolit/src/DataProcessors/Mon_Обмен/Mon_Обмен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Mon_Обмен</name>
  <attributes>
    <name>ВыгружатьСУдалением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШлюзОрганизации</name>
    <type>
      <types>CatalogRef.Mon_ШлюзыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьФоновыеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВыгрузки</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ114.CRM_Monolit/src/InformationRegisters/Mon_ВходящиеДанные/Mon_ВходящиеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Mon_ВходящиеДанные</name>
  <resources>
    <name>ТекстОбмена</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Mon_СтатусыОбработкиСтрокиРегистра</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШлюзОрганизации</name>
    <type>
      <types>CatalogRef.Mon_ШлюзыОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбмена</name>
    <type>
      <types>EnumRef.Mon_ВидыОбменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ114.CRM_Monolit/src/InformationRegisters/Mon_ИсходящиеДанные/Mon_ИсходящиеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Mon_ИсходящиеДанные</name>
  <resources>
    <name>ТекстОбмена</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Mon_СтатусыОбработкиСтрокиРегистра</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШлюзОрганизации</name>
    <type>
      <types>CatalogRef.Mon_ШлюзыОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбмена</name>
    <type>
      <types>EnumRef.Mon_ВидыОбменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ114.CRM_Monolit/src/DataProcessors/Mon_Обмен/Forms/ФормаОчистки/Module.bsl
&НаСервереБезКонтекста
Процедура ОчиститьНаСервере(ПериодЧистки)
	НачатьТранзакцию();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Mon_ВходящиеДанные.ШлюзОрганизации КАК ШлюзОрганизации,
	                      |	Mon_ВходящиеДанные.ВидОбмена КАК ВидОбмена,
	                      |	Mon_ВходящиеДанные.ДатаЗагрузки КАК ДатаЗагрузки,
	                      |	Mon_ВходящиеДанные.ТекстОбмена КАК ТекстОбмена,
	                      |	Mon_ВходящиеДанные.ДатаОбработки КАК ДатаОбработки,
	                      |	Mon_ВходящиеДанные.Статус КАК Статус
	                      |ИЗ
	                      |	РегистрСведений.Mon_ВходящиеДанные КАК Mon_ВходящиеДанные
	                      |ГДЕ
	                      |	Mon_ВходящиеДанные.ДатаЗагрузки < &ПериодНачала
	                      |	ИЛИ Mon_ВходящиеДанные.ДатаЗагрузки > &ПериодОкончания");
	Запрос.УстановитьПараметр("ПериодНачала",	ПериодЧистки.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончания",ПериодЧистки.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.Mon_ВходящиеДанные.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);

		
	КонецЦикла;
	НаборЗаписей.Записать();
	
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Mon_ИсходящиеДанные.ШлюзОрганизации КАК ШлюзОрганизации,
	                      |	Mon_ИсходящиеДанные.ВидОбмена КАК ВидОбмена,
	                      |	Mon_ИсходящиеДанные.ДатаОтчета КАК ДатаОтчета,
	                      |	Mon_ИсходящиеДанные.ДатаОбработки КАК ДатаОбработки,
	                      |	Mon_ИсходящиеДанные.ТекстОбмена КАК ТекстОбмена,
						  |	Mon_ИсходящиеДанные.Ответ КАК Ответ,
	                      |	Mon_ИсходящиеДанные.ДатаВыгрузки КАК ДатаВыгрузки,
	                      |	Mon_ИсходящиеДанные.Статус КАК Статус
	                      |ИЗ
	                      |	РегистрСведений.Mon_ИсходящиеДанные КАК Mon_ИсходящиеДанные
	                      |ГДЕ
	                      |	Mon_ИсходящиеДанные.ДатаОбработки < &ПериодНачала
	                      |	ИЛИ Mon_ИсходящиеДанные.ДатаОбработки > &ПериодОкончания");
	
	Запрос.УстановитьПараметр("ПериодНачала",	ПериодЧистки.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончания",ПериодЧистки.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.Mon_ИсходящиеДанные.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
	КонецЦикла;
	НаборЗаписей.Записать();
	//ОтменитьТранзакцию();
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере(ПериодЧистки);
КонецПроцедуры
